Revit 2027 API
BuiltInFailures.EditingFailures.TooManyElementsToCheckout Property
 Too many elements were attempted to be marked as editable, prompt user to mark workset(s) editable instead
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId TooManyElementsToCheckout { get; }
Public Shared ReadOnly Property TooManyElementsToCheckout As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ TooManyElementsToCheckout {
	FailureDefinitionId^ get ();
}
static member TooManyElementsToCheckout : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.EditingFailures Class
Autodesk.Revit.DB Namespace